solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/wm8962/fsl_wm8962.c
    switch (module)
    {
        case kWM8962_ModuleADC:
            (void)WM8962_ReadReg(handle, WM8962_LADC, &vol);
            vol &= 0xFFU;
            break;
        case kWM8962_ModuleDAC:
            (void)WM8962_ReadReg(handle, WM8962_LDAC, &vol);
            vol &= 0xFFU;
            break;
        case kWM8962_ModuleHeadphone:
            (void)WM8962_ReadReg(handle, WM8962_LOUT1, &vol);
            vol &= 0x7FU;
            break;
        default:
            vol = 0;
            break;
    }
    return vol;
}

status_t WM8962_SetModuleMute(wm8962_handle_t *handle, wm8962_module_t module, bool isEnabled)
{
    uint16_t vol = 0;
    status_t ret = kStatus_Success;
    switch (module)
    {
        case kWM8962_ModuleADC:
            /*
             * Digital Mute
             */
            if (isEnabled)
            {
                WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_LADC, &handle->volume[kWM8962_ModuleADC]), ret);
                WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_RADC, &handle->volume[kWM8962_ModuleADC]), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LADC, 0x100), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RADC, 0x100), ret);
            }
            else
            {
                vol = 0x100U | (uint16_t)handle->volume[kWM8962_ModuleADC];
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LADC, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RADC, vol), ret);
            }
            break;
        case kWM8962_ModuleDAC:
            /*
             * Digital mute
             */
            if (isEnabled)
            {
                WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_LDAC, &handle->volume[kWM8962_ModuleDAC]), ret);
                WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_RDAC, &handle->volume[kWM8962_ModuleDAC]), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LDAC, 0x100), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RDAC, 0x100), ret);
            }
            else
            {
                vol = 0x100U | (uint16_t)handle->volume[kWM8962_ModuleDAC];
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LDAC, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RDAC, vol), ret);
            }
            break;
        case kWM8962_ModuleHeadphone:
            /*
             * Analog mute
             */
            if (isEnabled)
            {
                WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_LOUT1, &handle->volume[kWM8962_ModuleHeadphone]), ret);
                WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_ROUT1, &handle->volume[kWM8962_ModuleHeadphone]), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT1, 0x100), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT1, 0x100), ret);
            }
            else
            {
                vol = 0x100U | (uint16_t)handle->volume[kWM8962_ModuleHeadphone];
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT1, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT1, vol), ret);
            }
            break;

        case kWM8962_ModuleSpeaker:
            if (isEnabled)
            {
                WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_LOUT2, &handle->volume[kWM8962_ModuleSpeaker]), ret);
                WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_ROUT2, &handle->volume[kWM8962_ModuleSpeaker]), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT2, 0x100), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT2, 0x100), ret);
            }
            else
            {
                vol = 0x100U | (uint16_t)handle->volume[kWM8962_ModuleSpeaker];
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT2, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT2, vol), ret);
            }
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

status_t WM8962_ConfigDataFormat(wm8962_handle_t *handle, uint32_t sysclk, uint32_t sample_rate, uint32_t bits)
{
    status_t retval = kStatus_Success;
    uint16_t val    = 0;
    uint32_t ratio  = sysclk / sample_rate;

    /*
     * Slave mode (MS = 0), LRP = 0, 32bit WL, left justified (FORMAT[1:0]=0b01)
     */
    switch (bits)
    {
        case 16:
            retval = WM8962_ModifyReg(handle, WM8962_IFACE0, WM8962_IFACE0_WL_MASK,
                                      WM8962_IFACE0_WL(WM8962_IFACE0_WL_16BITS));
            break;
        case 20:
            retval = WM8962_ModifyReg(handle, WM8962_IFACE0, WM8962_IFACE0_WL_MASK,
                                      WM8962_IFACE0_WL(WM8962_IFACE0_WL_20BITS));
            break;
        case 24:
            retval = WM8962_ModifyReg(handle, WM8962_IFACE0, WM8962_IFACE0_WL_MASK,
                                      WM8962_IFACE0_WL(WM8962_IFACE0_WL_24BITS));
            break;
        case 32:
            retval = WM8962_ModifyReg(handle, WM8962_IFACE0, WM8962_IFACE0_WL_MASK,
                                      WM8962_IFACE0_WL(WM8962_IFACE0_WL_32BITS));
            break;
        default:
            retval = kStatus_InvalidArgument;
            break;
    }

    if (kStatus_Success != retval)
    {
        return retval;
    }

    switch (sample_rate)
    {
        case kWM8962_AudioSampleRate8KHz:
            val = 0x15U;
            break;
        case kWM8962_AudioSampleRate11025Hz:
            val = 0x04U;
            break;
        case kWM8962_AudioSampleRate12KHz:
            val = 0x14U;
            break;
        case kWM8962_AudioSampleRate16KHz:
            val = 0x13U;
            break;
        case kWM8962_AudioSampleRate22050Hz:
            val = 0x02U;
            break;
        case kWM8962_AudioSampleRate24KHz:
            val = 0x12U;
            break;
        case kWM8962_AudioSampleRate32KHz:
            val = 0x11U;
            break;
        case kWM8962_AudioSampleRate44100Hz:
            val = 0x00U;
            break;
        case kWM8962_AudioSampleRate48KHz:
            val = 0x10U;
            break;
        case kWM8962_AudioSampleRate88200Hz:
            val = 0x06U;
            break;
        case kWM8962_AudioSampleRate96KHz:
            val = 0x16U;
            break;
        default:
            retval = kStatus_InvalidArgument;
            break;
    }

    if (kStatus_Success != retval)
    {
        return retval;
    }

